Repository: XianYuLauncher/XianYuLauncher
Catalog: XianYuLauncher/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_tw

# Settings_GameDownloadSourceExpander.Description
source: Download sources for game core and ModLoader
zh_tw: 遊戲本體、ModLoader 的下載源

# Settings_VersionManifestSourceCard.Header
source: Version Manifest
zh_tw: 版本清單

# Settings_VersionManifestSourceCard.Description
source: Retrieve version lists and related metadata
zh_tw: 獲取版本列表等

# Settings_FileDownloadSourceCard.Header
source: File Downloads
zh_tw: 檔案下載

# Settings_FileDownloadSourceCard.Description
source: client.jar, libraries, and more
zh_tw: client.jar、libraries 等

# DownloadSource_DisplayName_Official
source: Official Source
zh_tw: 官方源

# DownloadSource_DisplayName_Bmclapi
source: BMCLAPI Mirror
zh_tw: BMCLAPI 映象

# DownloadSource_DisplayName_Mcim
source: MCIM Mirror
zh_tw: MCIM 映象

# DownloadSource_DisplayName_Custom
source: Custom
zh_tw: 自定義

# Settings_ModrinthCurseForgeSourceExpander.Header
source: Community Resource Source
zh_tw: 社群資源下載源

# Settings_ModrinthCurseForgeSourceExpander.Description
source: Download source for Modrinth and CurseForge resources
zh_tw: Modrinth、CurseForge 資源的下載源

# Settings_ModrinthResourceSource.Header
source: Modrinth Source
zh_tw: Modrinth 下載源

# Settings_ModrinthResourceSource.Description
source: Download source for Modrinth resources
zh_tw: Modrinth 資源的下載源

# Settings_CurseForgeResourceSource.Header
source: CurseForge Source
zh_tw: CurseForge 下載源

# Settings_CurseForgeResourceSource.Description
source: Download source for CurseForge resources
zh_tw: CurseForge 資源的下載源

# Settings_OpenCustomSourceConfig.Header
source: Custom Source Configuration
zh_tw: 自定義源配置

# Settings_OpenCustomSourceConfig.Description
source: Open configuration folder to manually add or manage config files
zh_tw: 開啟配置資料夾，可手動新增或管理配置檔案

# Settings_OpenConfigFolder.Content
source: Open Config Folder
zh_tw: 開啟配置資料夾

# VersionManagerPage_UpdatableResourcesLabel.Text
source: Updatable Resources
zh_tw: 可更新資源

# VersionManagerPage_UpdatableResourcesBannerTitle.Text
source: Updates Available
zh_tw: 有可更新元件

# VersionManagerPage_UpdatableResourcesDescriptionFormat
source: Detected {0} updatable components for this version
zh_tw: 檢測到此版本有 {0} 項元件更新

# VersionManagerPage_UpdateAllResourcesButton.ToolTipService.ToolTip
source: Update All
zh_tw: 一鍵更新

# VersionManagerPage_UpdatableResourcesUpdateDialog.Title
source: Update All
zh_tw: 一鍵更新

# VersionManagerPage_UpdatableResourcesUpdateDialog.InstructionText
source: Select the components you want to update:
zh_tw: 請勾選你想要更新的元件：

# VersionManagerPage_UpdatableResourcesUpdateDialog.PrimaryButtonText
source: Confirm Update
zh_tw: 確認更新

# VersionManagerPage_UpdatableResourcesUpdateDialog.CloseButtonText
source: Cancel
zh_tw: 取消

# VersionManagerPage_UpdateResultDialog_Title
source: Update Complete
zh_tw: 更新完成

# VersionManagerPage_UpdateResultDialog_PrimaryButtonText
source: OK
zh_tw: 確定

# VersionManagerPage_MoveModsDialog_Title
source: Select Target Version
zh_tw: 選擇目標版本

# VersionManagerPage_MoveModsDialog_InstructionContent
source: Please select the target version to migrate to:
zh_tw: 請選擇要遷移到的目標版本：

# VersionManagerPage_MoveModsDialog_PrimaryButtonText
source: Confirm Migration
zh_tw: 確認遷移

# VersionManagerPage_MoveModsDialog_CloseButtonText
source: Cancel
zh_tw: 取消

# VersionManagerPage_MoveResultDialog_Title
source: Migration Result
zh_tw: 遷移結果

# VersionManagerPage_MoveResultDialog_InstructionContent
source: The following are the migration results:
zh_tw: 以下是本次遷移結果：

# VersionManagerPage_MoveResultDialog_PrimaryButtonText
source: OK
zh_tw: 確定

# VersionManagerPage_SaveConfigDialog_Title
source: Save Configuration
zh_tw: 儲存配置

# VersionManagerPage_ModpackUpdateDialog_Title
source: Update Modpack
zh_tw: 更新整合包

# VersionManagerPage_UpdatableResourcesUpdateDialog_Title
source: Update All
zh_tw: 一鍵更新

# VersionManagerPage_UpdatableResourcesUpdateDialog_InstructionText
source: Select the components you want to update:
zh_tw: 請勾選你想要更新的元件：

# VersionManagerPage_UpdatableResourcesUpdateDialog_PrimaryButtonText
source: Confirm Update
zh_tw: 確認更新

# VersionManagerPage_UpdatableResourcesUpdateDialog_CloseButtonText
source: Cancel
zh_tw: 取消

# VersionManagerPage_ModpackUpdateBannerTitle.Text
source: Modpack Update
zh_tw: 整合包更新

# VersionManagerPage_ModpackUpdateCheckingStatus
source: Checking modpack updates...
zh_tw: 正在檢查整合包更新...

# VersionManagerPage_ModpackAlreadyLatestStatus
source: You are already on the latest modpack version
zh_tw: 當前已是最新整合包版本

# VersionManagerPage_ModpackUpdateAvailableStatus
source: A newer modpack version is available
zh_tw: 檢測到新版本整合包可更新

# VersionManagerPage_ModpackUpdateAvailableWithVersionStatusFormat
source: New version detected: {0}
zh_tw: 檢測到新版本：{0}

# VersionManagerPage_ModpackNotDetectedStatus
source: Current version is not a modpack instance
zh_tw: 當前版本不是整合包例項

# VersionManagerPage_ModpackUpdateReservedStatus
source: Automatic modpack update is coming soon
zh_tw: 整合包自動更新即將上線，敬請期待

# VersionManagerPage_ModpackSectionTitle.Text
source: Modpack
zh_tw: 整合包

# VersionManagerPage_ModpackVersionExpander.Header
source: Change Modpack Version
zh_tw: 修改整合包版本

# VersionManagerPage_ModpackVersionComboBox.PlaceholderText
source: Select a modpack version
zh_tw: 請選擇整合包版本

# VersionManagerPage_ModpackVersionNotSelectedStatus
source: Please select a target modpack version first
zh_tw: 請先選擇目標整合包版本

# VersionManagerPage_ModpackUpdateQueuedWithTargetStatusFormat
source: Added modpack update to the download queue: {0}
zh_tw: 已將整合包更新加入下載佇列：{0}

# VersionManagerPage_ModpackUpdateSuccessWithTargetStatusFormat
source: Modpack update completed. Current version: {0}
zh_tw: 整合包更新完成，當前版本：{0}

# VersionManagerPage_ModpackUpdateRefreshFailedWithErrorStatusFormat
source: Modpack update completed, but refreshing the page failed: {0}
zh_tw: 整合包更新完成，但重新整理頁面失敗：{0}

# VersionManagerPage_ModpackUpdateDownloadUrlEmpty
source: The target modpack version is missing a download URL
zh_tw: 目標整合包版本缺少下載地址

# VersionManagerPage_ModpackUpdateReservedWithTargetStatusFormat
source: Automatic modpack update is coming soon. Selected target version: {0}
zh_tw: 整合包自動更新即將上線，已選擇目標版本：{0}

# Settings_GlobalCustomGameDirectoryCard.Header
source: Custom Game Directory
zh_tw: 自定義遊戲目錄

# Settings_GlobalCustomGameDirectoryCard.Description
source: Only effective when "Custom Path" is selected
zh_tw: 僅在選擇“自定義路徑”時生效

# Settings_GlobalCustomGameDirectoryPathBox.PlaceholderText
source: Select a custom game directory
zh_tw: 請選擇自定義遊戲目錄

# Settings_GlobalCustomGameDirectoryBrowseButton.Content
source: Browse...
zh_tw: 瀏覽...

# Settings_GlobalCustomGameDirectoryClearButton.Content
source: Clear
zh_tw: 清除

# Settings_GameDirMode_Default
source: Disable
zh_tw: 禁用

# Settings_GameDirMode_VersionIsolation
source: Enable
zh_tw: 啟用

# Settings_GameDirMode_Custom
source: Custom Path
zh_tw: 自定義路徑

# VersionSettings_LocalVersionIsolation.Header
source: Game Directory Isolation
zh_tw: 版本隔離

# VersionSettings_LocalVersionIsolation.Description
source: Select the isolation mode and custom game directory path
zh_tw: 選擇遊戲目錄的隔離模式與自定義路徑

# VersionSettings_LocalCustomGameDirectoryCard.Header
source: Custom Game Directory
zh_tw: 自定義遊戲目錄

# VersionSettings_LocalCustomGameDirectoryCard.Description
source: Only effective when "Custom Path" is selected
zh_tw: 僅在選擇“自定義路徑”時生效

# VersionSettings_LocalCustomGameDirectoryPathBox.PlaceholderText
source: Select a custom directory path
zh_tw: 選擇自定義目錄路徑

# VersionSettings_LocalCustomGameDirectoryBrowseButton.Content
source: Browse...
zh_tw: 瀏覽...

# VersionSettings_LocalCustomGameDirectoryClearButton.Content
source: Clear
zh_tw: 清除

# TutorialPage_PersonalizationSection_Title.Text
source: Personalization
zh_tw: 個性化

# TutorialPage_ThemeSettings.Header
source: Theme
zh_tw: 主題

# TutorialPage_ThemeSettings.Description
source: Choose the appearance theme
zh_tw: 選擇應用的外觀主題

# TutorialPage_Theme_Light.Content
source: Light
zh_tw: 淺色

# TutorialPage_Theme_Dark.Content
source: Dark
zh_tw: 深色

# TutorialPage_Theme_Default.Content
source: System Default
zh_tw: 跟隨系統

# TutorialPage_WindowMaterial.Header
source: Window Material
zh_tw: 視窗材質

# TutorialPage_WindowMaterial.Description
source: Choose the window background effect
zh_tw: 選擇視窗背景效果

# TutorialPage_LanguageSettings.Header
source: Language
zh_tw: 語言

# TutorialPage_LanguageSettings.Description
source: Choose the display language
zh_tw: 選擇應用的顯示語言

# TutorialPage_Language_Chinese.Content
source: 简体中文
zh_tw: 簡體中文

# TutorialPage_GameSettings_Title.Text
source: Game Settings
zh_tw: 遊戲設定

# TutorialPage_VersionIsolation.Header
source: Version Isolation
zh_tw: 啟用版本隔離

# TutorialPage_VersionIsolation.Description
source: Each version uses a separate directory, mods don't interfere with each other (recommended)
zh_tw: 每個版本使用獨立目錄，Mod 互不干擾（推薦開啟）

# TutorialPage_BlurAmount.Header
source: Blur Intensity
zh_tw: 模糊強度

# TutorialPage_BlurAmount.Description
source: Adjust the blur intensity of the background image
zh_tw: 調整背景圖片的模糊程度

# ErrorAnalysis_NoCrashPlaceholder.Text
source: No crash content, because the game hasn't crashed yet...
zh_tw: 沒有崩潰內容，因為遊戲還沒崩潰...

# LaunchPage_LaunchGameText.Text
source: Launch Game
zh_tw: 啟動遊戲

# LaunchPage_ViewInBrowserButton.Content
source: View details in browser
zh_tw: 在瀏覽器中檢視詳情

# LaunchPage_DevBuildInfoBar.Title
source: Development Build
zh_tw: 開發版

# LaunchPage_DevBuildInfoBar.Message
source: May be unstable. Please report issues to the developers.
zh_tw: 可能不穩定，遇到問題請向開發人員反饋。

# VersionManagementPage_DisableToggle.OffContent
source: Disabled
zh_tw: 禁用

# VersionManagementPage_DeleteButton.Content
source: Delete
zh_tw: 刪除

# Settings_JavaPathTextBox.PlaceholderText
source: Select Java executable path
zh_tw: 請選擇 Java 可執行檔案路徑

# Settings_JavaBrowseButton.Content
source: Browse...
zh_tw: 瀏覽...

# Settings_JavaClearButton.Content
source: Clear
zh_tw: 清除

# Settings_BackgroundBrowseButton.Content
source: Browse...
zh_tw: 瀏覽...

# Settings_BackgroundClearButton.Content
source: Clear
zh_tw: 清除

# Settings_BackgroundPlaceholderText.PlaceholderText
source: Select background image
zh_tw: 請選擇背景圖片

# Settings_BlurAmount.Header
source: Blur Intensity
zh_tw: 模糊強度

# Settings_BlurAmount.Description
source: Adjust the blur intensity of the background image
zh_tw: 調整背景圖片的模糊程度

# Msg_Success
source: Success
zh_tw: 成功

# Msg_Failed
source: Failed
zh_tw: 失敗

# Msg_Error
source: Error
zh_tw: 錯誤

# Msg_Prompt
source: Prompt
zh_tw: 提示

# Msg_Warning
source: Warning
zh_tw: 警告

# Msg_OperationFailed
source: Operation failed
zh_tw: 操作失敗

# Msg_SaveFailed
source: Save failed
zh_tw: 儲存失敗

# Msg_SaveSuccess
source: Save successful
zh_tw: 儲存成功

# Msg_UploadSuccess
source: Upload successful
zh_tw: 上傳成功

# Msg_UploadFailed
source: Upload failed
zh_tw: 上傳失敗

# Msg_ValidationFailed
source: Validation failed
zh_tw: 驗證失敗

# Msg_DownloadCancelled
source: Download cancelled.
zh_tw: 下載已取消。

# Msg_DownloadInProgress
source: A download task is in progress. Please wait until it completes.
zh_tw: 當前有下載任務正在進行，請等待完成後再試。

# Msg_NoInstalledVersion
source: No installed game version found. Please install a game version first.
zh_tw: 未找到已安裝的遊戲版本，請先安裝遊戲版本。

# Msg_InvalidShareCode
source: Share code is empty or in incorrect format.
zh_tw: 分享碼內容為空或格式不正確。

# Msg_SelectGameVersion
source: Please select a game version.
zh_tw: 請選擇一個遊戲版本。

# Msg_FavoritesEmpty
source: Favorites are empty; cannot import.
zh_tw: 收藏夾為空，無法匯入。

# Msg_NoModVersionSelected
source: No mod version selected for download
zh_tw: 未選擇要下載的 Mod 版本

# Msg_SelectModVersion
source: Please select a mod version to download first
zh_tw: 請先選擇要下載的 Mod 版本

# Msg_NoSaveFound
source: No save file found. Please launch the game and create a world first.
zh_tw: 未找到存檔，請先啟動遊戲建立一個世界。

# Msg_SelectInstallVersion
source: Please select a game version to install first.
zh_tw: 請先選擇要安裝的遊戲版本。

# Msg_SelectGameVersionFirst
source: Please select a game version first
zh_tw: 請先選擇一個遊戲版本

# Msg_SelectCharacterFirst
source: Please select a character first
zh_tw: 請先選擇一個賬戶

# Msg_GeneratingLaunchParams
source: Generating launch parameters...
zh_tw: 正在生成啟動引數...

# Msg_GenerateLaunchParamsFailed
source: Failed to generate launch parameters
zh_tw: 生成啟動引數失敗

# Msg_SkinChangedTo
source: Changed skin to {0}
zh_tw: 已將皮膚更改為 {0}

# Msg_ApplySkinFailed
source: Failed to apply skin: {0}
zh_tw: 應用皮膚失敗: {0}

# Msg_NoSkinTexture
source: No skin texture available to save
zh_tw: 沒有可儲存的皮膚紋理

# Msg_SkinSavedTo
source: Skin texture saved to: {0}
zh_tw: 皮膚紋理已儲存到: {0}

# Msg_SkinSaveError
source: Error saving skin texture: {0}
zh_tw: 儲存皮膚紋理時發生錯誤: {0}

# Msg_OfflineNoSkinUpload
source: Offline mode does not support uploading skins
zh_tw: 離線模式不支援上傳皮膚

# Msg_SkinUploaded
source: Skin uploaded successfully
zh_tw: 皮膚已成功上傳

# Msg_ApiRequestFailed
source: API request failed: {0}
zh_tw: API 請求失敗: {0}

# Msg_SkinUploadError
source: Error uploading skin: {0}
zh_tw: 上傳皮膚時發生錯誤: {0}

# Msg_SkinMustBePng
source: Skin file must be in PNG format
zh_tw: 皮膚檔案必須是 PNG 格式

# Msg_SkinMustBe64x64
source: Skin file must be 64x64 pixels
zh_tw: 皮膚檔案必須是 64x64 尺寸

# Msg_SkinValidationError
source: Cannot validate skin file: {0}
zh_tw: 無法驗證皮膚檔案: {0}

# Msg_CapeMustBePng
source: Cape file must be in PNG format
zh_tw: 披風檔案必須是 PNG 格式

# Msg_CapeValidationError
source: Cannot validate cape file: {0}
zh_tw: 無法驗證披風檔案: {0}

# Msg_OfflineNoCapeUpload
source: Offline mode does not support uploading capes
zh_tw: 離線模式不支援上傳披風

# Msg_ExternalNoCapeUpload
source: External login does not support uploading capes yet
zh_tw: 外接登入暫不支援上傳披風

# Msg_MsNoCapeUpload
source: Microsoft accounts do not support direct cape uploads
zh_tw: 微軟賬戶不支援直接上傳披風

# Msg_UploadTip
source: Upload tip
zh_tw: 上傳提示

# Msg_CapeUploaded
source: Cape uploaded successfully
zh_tw: 披風已成功上傳

# Msg_CapeUploadError
source: Error uploading cape: {0}
zh_tw: 上傳披風時發生錯誤: {0}

# Msg_NoVersionSelected
source: No version selected
zh_tw: 未選擇版本

# Msg_SelectVersionFirst
source: Please select a version first
zh_tw: 請先選擇一個版本

# Msg_LoadingVersionData
source: Loading version data...
zh_tw: 正在載入版本資料...

# Msg_NoUpdatableResources
source: No updatable resources currently available.
zh_tw: 當前沒有可更新的資源。

# Msg_UpdateCancelled
source: Update cancelled.
zh_tw: 已取消更新。

# Msg_NoTargetResources
source: No target resources to update identified.
zh_tw: 未識別到可更新的目標資源。

# Msg_UpdatingResources
source: Updating resources...
zh_tw: 正在更新資源...

# Msg_UpdatingMods
source: Updating Mods...
zh_tw: 正在更新 Mod...

# Msg_UpdatingShaders
source: Updating Shaders...
zh_tw: 正在更新光影...

# Msg_UpdatingResourcePacks
source: Updating Resource Packs...
zh_tw: 正在更新資源包...

# Msg_AddCustomSource
source: Add Custom Download Source
zh_tw: 新增自定義下載源

# Msg_EditCustomSource
source: Edit Custom Download Source
zh_tw: 編輯自定義下載源

# Msg_Save
source: Save
zh_tw: 儲存

# Msg_Cancel
source: Cancel
zh_tw: 取消

# Msg_Update
source: Update
zh_tw: 更新

# Msg_Loading
source: Loading...
zh_tw: 載入中...

# Msg_NoRecommendation
source: No recommendations
zh_tw: 暫無推薦

# Msg_LoadFailed
source: Failed to load
zh_tw: 載入失敗

# Msg_ProcessingDragDrop
source: Processing dropped files...
zh_tw: 正在處理拖放檔案...

# Msg_RegionRestriction
source: Region Restriction
zh_tw: 地區限制

# Msg_OfflineLoginRegionRestricted
source: Offline login is not available in your region. Please use Microsoft account login.
zh_tw: 當前地區無法使用離線登入，請使用微軟賬戶登入。

# Msg_ExternalLoginRegionRestricted
source: External login is not available in your region. Please use Microsoft account login.
zh_tw: 當前地區無法使用外接登入，請使用微軟賬戶登入。

# Msg_OfflineNoTokenRefresh
source: Offline accounts do not need to refresh tokens
zh_tw: 離線賬戶無需續簽令牌

# Msg_RefreshToken
source: Refresh Token
zh_tw: 續簽令牌

# Msg_LoginFailed
source: Login failed
zh_tw: 登入失敗

# Dialog_LoginMethod_Title
source: Select Login Method
zh_tw: 選擇登入方式

# Dialog_LoginMethod_Instruction
source: Please select your preferred login method:
zh_tw: 請選擇您喜歡的登入方式：

# Dialog_LoginMethod_BrowserDesc
source: • Browser Login: Opens system default browser for login (recommended)
zh_tw: • 微軟賬號登入：使用 Windows 系統賬戶選擇器完成認證 (推薦)

# Dialog_LoginMethod_DeviceCodeDesc
source: • Device Code Login: Get a code and manually enter it on a webpage
zh_tw: • 裝置程式碼登入：獲取程式碼後手動訪問網頁輸入

# Dialog_LoginMethod_BrowserButton
source: Browser Login
zh_tw: 微軟賬號登入

# Dialog_LoginMethod_DeviceCodeButton
source: Device Code Login
zh_tw: 裝置程式碼登入

# Dialog_SkinModel_Title
source: Select Skin Model
zh_tw: 選擇皮膚模型

# Dialog_SkinModel_Content
source: Please select the character model for this skin
zh_tw: 請選擇此皮膚適用的人物模型

# Dialog_JavaNotFound_Title
source: Java Runtime Not Found
zh_tw: Java 執行時環境未找到

# Dialog_JavaNotFound_Content
source: No Java runtime found for the current game version. Game version requires: Java {0} We recommend using the auto-download feature to install and configure automatically.
zh_tw: 未找到適用於當前遊戲版本的 Java 執行時環境。 遊戲版本需要: Java {0} 推薦使用自動下載功能，啟動器將自動安裝並配置環境。

# Dialog_JavaNotFound_AutoDownload
source: Auto Download (Recommended)
zh_tw: 自動下載(推薦)

# Dialog_JavaNotFound_ManualDownload
source: Manual Download
zh_tw: 手動下載

# Dialog_OfflineTip_Title
source: Offline Play Reminder
zh_tw: 離線遊玩提示

# Dialog_OfflineTip_Content
source: You have launched in offline mode {0} times. Consider supporting the official version!
zh_tw: 您已經使用離線模式啟動{0}次了,支援一下正版吧！

# Dialog_OfflineTip_OK
source: Got It
zh_tw: 知道了

# Dialog_OfflineTip_Support
source: Support Official
zh_tw: 支援正版

# Dialog_ExportSuccess_Title
source: Export Successful
zh_tw: 匯出成功

# Dialog_ExportSuccess_Content
source: Launch parameters exported to desktop: {0} You can double-click the file to launch the game.
zh_tw: 啟動引數已成功匯出到桌面: {0} 您可以雙擊該檔案來啟動遊戲。

# Dialog_ExportSuccess_OpenLocation
source: Open File Location
zh_tw: 開啟檔案位置

# Dialog_RegionRestricted_Title
source: Region Restriction
zh_tw: 地區限制

# Dialog_RegionRestricted_Go
source: Go
zh_tw: 前往

# Dialog_Privacy_Agree
source: Agree
zh_tw: 同意

# Dialog_Privacy_Agreement
source: User Agreement
zh_tw: 使用者協議

# Dialog_Privacy_Reject
source: Decline
zh_tw: 拒絕

# Dialog_Crash_Title
source: Game Crashed
zh_tw: 遊戲崩潰

# Dialog_Crash_ExportLog
source: Export Crash Log
zh_tw: 匯出崩潰日誌

# Dialog_Crash_ViewLog
source: View Detailed Log
zh_tw: 檢視詳細日誌

# Dialog_Crash_Close
source: Close
zh_tw: 關閉

# Dialog_Crash_InstructionTitle
source: How to Get Help
zh_tw: 正確的求助步驟

# Dialog_Crash_Step1
source: 1. Click the "Export Crash Log" button below
zh_tw: 1. 點選下方「匯出崩潰日誌」按鈕

# Dialog_Crash_Step2
source: 2. Send the exported ZIP file to technical support
zh_tw: 2. 將匯出的 ZIP 檔案傳送給技術支援

# Dialog_Crash_LogInfo
source: Log files contain launcher logs, game logs, and other info to help quickly diagnose the issue
zh_tw: 日誌檔案包含啟動器日誌、遊戲日誌等資訊，能幫助快速定位問題

# Dialog_Crash_LogPreview
source: View Log Preview
zh_tw: 檢視日誌預覽

# Dialog_AddServer_Title
source: Add Server
zh_tw: 新增伺服器

# Dialog_AddServer_NameHeader
source: Server Name
zh_tw: 伺服器名稱

# Dialog_AddServer_AddressHeader
source: Server Address
zh_tw: 伺服器地址

# Dialog_AddServer_AddressPlaceholder
source: e.g. 127.0.0.1
zh_tw: 例如: 127.0.0.1

# Dialog_AddServer_AddButton
source: Add
zh_tw: 新增

# Dialog_FavoritesImport_Unsupported
source: The following resources are not supported for the selected version:
zh_tw: 以下資源不支援所選版本：

# Dialog_FavoritesImport_Title
source: Some resources not supported for this version
zh_tw: 部分資源不支援此版本

# Dialog_OK
source: OK
zh_tw: 確定

# Dialog_Confirm
source: Confirm
zh_tw: 確認

# Dialog_Install
source: Install
zh_tw: 安裝

# Dialog_AllPublishers
source: All Publishers
zh_tw: 所有釋出者

# Dialog_CustomSource_NameHeader
source: Source Name
zh_tw: 源名稱

# Dialog_CustomSource_NamePlaceholder
source: e.g. My Mirror
zh_tw: 例如：我的映象站

# Dialog_CustomSource_PriorityHeader
source: Priority (higher value = higher priority)
zh_tw: 優先順序（數值越大優先順序越高）

# Dialog_CustomSource_TemplateHeader
source: Template Type
zh_tw: 模板型別

# Dialog_CustomSource_OfficialResource
source: Official Resources
zh_tw: 官方資源

# Dialog_CustomSource_CommunityResource
source: Community Resources
zh_tw: 社群資源

# Dialog_CustomSource_EnableHeader
source: Enable
zh_tw: 啟用

# Shell_启动.Content
source: Launch
zh_cn: 启动

# Shell_资源下载.Content
source: Download
zh_cn: 下载

# Shell_Mod.Content
source: Mods
zh_cn: 模组

# Shell_版本列表.Content
source: Versions
zh_cn: 版本列表

# Shell_角色.Content
source: Profile
zh_cn: 角色

# Shell_联机.Content
source: Multiplayer
zh_cn: 联机

# Settings_MinecraftPath.Text
source: Minecraft Path
zh_cn: Minecraft 路径

# Settings_VersionIsolation.Text
source: Enable Version Isolation
zh_cn: 启用版本隔离

# Settings_Theme.Text
source: Theme
zh_cn: 主题

# Settings_WindowMaterial.Text
source: Window Material
zh_cn: 窗口材质

# Settings_Language.Text
source: Language
zh_cn: 语言

# Settings_JavaVersionManagement.Text
source: Java Version Management
zh_cn: Java版本管理

# Settings_JavaSelectionMode.Text
source: Java Selection Mode
zh_cn: Java选择方式

# Settings_JavaPathLabel.Text
source: Java Path
zh_cn: Java路径

# Settings_DownloadSource.Text
source: Download Source
zh_cn: 下载源设置

# Settings_SelectVersionListSource.Text
source: Select Version List Source
zh_cn: 选择版本列表源

# Settings_DownloadDependencies.Text
source: Download Dependencies
zh_cn: 下载前置Mod

# Settings_HideSnapshotVersions.Text
source: Mod Hide Snapshot Versions
zh_cn: Mod隐藏快照版本

# Settings_DownloadThreadCount.Text
source: Download Threads
zh_cn: 下载线程数

# Settings_Acknowledgments.Text
source: Acknowledgments
zh_cn: 鸣谢

# TutorialPage_Title.Text
source: Tutorial
zh_cn: 新手教程

# TutorialPage_Subtitle.Text
source: Please complete the following settings to run Minecraft properly
zh_cn: 请完成以下设置，以便正常运行Minecraft

# TutorialPage_AutoJavaSelection.Content
source: Auto-select Java from list
zh_cn: 自动从列表内选择Java

# TutorialPage_ManualJavaSelection.Content
source: Manually select Java
zh_cn: 手动选择Java

# TutorialPage_ProfileSelectionTitle.Text
source: Profile Selection
zh_cn: 角色选择

# TutorialPage_ProfileNameTitle.Text
source: Profile Name
zh_cn: 角色名称

# TutorialPage_OfflineProfileNameTitle.Text
source: Profile Name
zh_cn: 角色名称

# TutorialPage_OfflineProfileNameTextBox.PlaceholderText
source: Please enter profile name
zh_cn: 请输入角色名称

# LaunchPage_PlayerName.Text
source: Profile
zh_cn: 选择角色

# LaunchPage_AddProfile.Text
source: Add Profile
zh_cn: 添加角色

# Settings_About.Text
source: About this application
zh_cn: 关于此应用

# 联机Page_Subtitle.Text
source: Choose Host/Guest
zh_cn: 选择房主/房客

# 联机Page_WarningTitle.Text
source: Warning
zh_cn: 警告

# 联机Page_WarningMessage.Text
source: Terracotta is third-party open-source free software. Please provide feedback through its official channels if you encounter any issues while using it. Terracotta is based on P2P peer-to-peer technology. After successful connection, direct network connections will be established between users in the room, with no public relay nodes and no traffic forwarded through third-party servers. The final multiplayer experience depends on the network environment of the participants. You must strictly abide by all laws and regulations of your country and region when using the multiplayer feature, and must not use it for any illegal, non-compliant, or commercial activities.
zh_cn: 陶瓦联机是第三方开源自由软件，您在使用过程中所遇到的问题请通过其官方渠道进行反馈。陶瓦联机基于 P2P 点对点技术实现，联机成功后房间内用户之间将直接建立网络连接，无任何公共中转节点、不通过第三方服务器转发流量，最终联机体验取决于参与联机者的网络环境。您在使用多人联机功能的全过程中，必须严格遵守您所在国家与地区的全部法律法规，不得用于任何违法违规及经营性活动。

# 联机Page_HostCardTitle.Text
source: I want to be a Host
zh_cn: 我想当房主

# 联机Page_HostCardDescription.Text
source: Create a new game room and invite other players to join
zh_cn: 创建一个新的游戏房间，邀请其他玩家加入

# 联机Page_GuestCardTitle.Text
source: I want to be a Guest
zh_cn: 我想当房客

# 联机Page_GuestCardDescription.Text
source: Join a game room created by other players
zh_cn: 加入其他玩家创建的游戏房间

# 联机大厅Page_Title.Text
source: Multiplayer Lobby
zh_cn: 联机大厅

# 联机大厅Page_RoomIdPrefix.Text
source: Room ID:
zh_cn: 房间ID:

# 联机大厅Page_ExitButton.Content
source: Exit Room
zh_cn: 退出房间

# 联机大厅Page_PlayerListTitle.Text
source: Player List
zh_cn: 玩家列表

# 联机大厅Page_EmptyPlayerList.Text
source: No other players currently...
zh_cn: 当前没有其他玩家...
